memory-game-backend/app/controllers/api/v1/games_controller.rb

SELECT "games".* FROM "games"
---
    def index
        @games = Game.all.max_by(10) { |game| game.score }

INSERT INTO "games" ("username", "score", "card_set_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "hi"], ["score", 0], ["card_set_id", 1], ["created_at", "2020-02-13 20:14:18.501764"], ["updated_at", "2020-02-13 20:14:18.501764"]]
---
    def create
        @game = Game.create!(game_params)

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 12]]
SELECT "games".* FROM "games"
---
    def destroy
        @game = Game.find(params[:id])
        @game.destroy
        @games = Game.all.max_by(10) { |game| game.score }